package quiz_label

type QuizLabel struct {
	Id         int
	Name       string
	Label      string
	ShortLabel string
}

func GetQuizLabels() []QuizLabel {
	return []QuizLabel{
		{
			1,
			"quiz_first_ptsd",
			"Опитувальник для первинного скринінгу ПТСР",
			"первинний скринінг ПТСР",
		},
		{
			2,
			"quiz_kotenov_5_57",
			"Дослідження травматичного стресу (І. Котєньов)",
			"Опитувальник І.О. Котєньов",
		},
		{
			3,
			"quiz_hads",
			"Госпітальна шкала тривоги та депресії (HADS)",
			"HADS",
		},
		{
			4,
			"quiz_ies_r_5_54",
			"Дослідження впливу травмівної події (IES-R) 5.54",
			"5.54 IES-R",
		},
		{
			5,
			"quiz_nps_prognoz_2",
			"Дослідження рівня нервово-психічної стійкості військовослужбовців – Прогноз 2 (В. Рибніков)",
			"5.48 НПС",
		},
		{
			6,
			"quiz_minimult",
			"Скорочений багатофакторний опитувальник для дослідження особистості «міні-мульт»",
			"Міні-мульт",
		},
		{
			7,
			"quiz_adaptability_200",
			"Адаптивність 200",
			"Адаптивність 200",
		},
		{
			8,
			"quiz_stai",
			"Шкала тривоги Спілбергера – Ханіна",
			"5.51 Шкала Спілбергера – Ханіна",
		},
		{
			9,
			"quiz_eysenck",
			"Дослідження психічний станів Г. Айзенк",
			"Дослідження Г. Айзенк",
		},
		{
			10,
			"quiz_lnp",
			"Визначення рівня невротизації та психопатизаці (РНП)",
			"РНП",
		},
		{
			11,
			"quiz_iso",
			"Індивідуальна суїцидальна спрямованість (ІСС)",
			"ІСС",
		},
		{
			12,
			"quiz_qsr",
			"Опитувальник суїцидального ризику (ОСР) в модифікації Т.М. Разуваєвої",
			"ОСР Т.М. Разуваєвої",
		},
		{
			13,
			"quiz_dfp",
			"Опитувальник для визначення рівня схильності до девіантних форм поведінки та порушення статутних правил взаємодії",
			"ДФП",
		},
		{
			14,
			"quiz_occupational_burnout",
			"Дослідження емоційного вигорання",
			"5.45 Емоційне вигорання",
		},
	}
}

func GetQuizLabelById(id int) QuizLabel {
	for _, ql := range GetQuizLabels() {
		if ql.Id == id {
			return ql
		}
	}
	return QuizLabel{}
}

func GetQuizLabelByName(name string) QuizLabel {
	for _, ql := range GetQuizLabels() {
		if ql.Name == name {
			return ql
		}
	}
	return QuizLabel{}
}
